src_ext/Documents/УЗ_ДоговорОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УЗ_ДоговорОбучения</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Программа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеСтоимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЦеныТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЦеныТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУроков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_РеквизитыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_РеквизитыОрганизаций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИПБезЛицензии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЛицензии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЛицензии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛицензиюВыдал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьПодписанта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежныеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ДокументыФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ДокументыФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Catalogs/УЗ_Абонемент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_Абонемент</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗанятий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаАбонемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Приостановки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПриостановки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозобновления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Documents/УЗ_ДоговорОбучения/Ext/ManagerModule.bsl
//Договор на оказание платных образовательных услуг (этап 2.1, В43): номер и дата — у документа, стороны —
//исполнитель (организация, лицензия — УЗ_РеквизитыОрганизаций), заказчик (плательщик; пусто — обучающийся сам),
//обучающийся. Текст — нейтральный шаблон по Правилам оказания платных образовательных услуг (постановление
//Правительства РФ от 15.09.2020 № 1441, п. 13), ст. 54 Федерального закона «Об образовании в Российской Федерации»,
//ст. 32 Закона «О защите прав потребителей» и ст. 782 ГК РФ — общими словами; перед использованием текст проверяет
//юрист покупателя (форма договора и справка F1 говорят об этом).

#Область ПрограммныйИнтерфейс

// Печать — точка входа подменю «Печать» (сигнатура БСП; вызывают форма печати хозяина
// и своя печать УЗ_Печать.СформироватьСвоейПечатью).
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УЗ_Печать.НужноПечататьМакет(КоллекцияПечатныхФорм, "Договор") Тогда
		УЗ_Печать.ВывестиВКоллекцию(КоллекцияПечатныхФорм, "Договор", НСтр("ru = 'Договор обучения'"),
			ПечатьДоговора(МассивОбъектов, ОбъектыПечати));
		УЗ_Печать.УстановитьЗаголовок(ПараметрыВывода, НСтр("ru = 'Договор обучения'"));
	КонецЕсли;

КонецПроцедуры

//Порядок оплаты по умолчанию — поле «Порядок оплаты» нового договора.
Функция ПорядокОплатыПоУмолчанию() Экспорт

	Возврат НСтр("ru = 'Оплата вносится до начала занятий: за абонемент — единовременно при его приобретении, за "
		+ "отдельные занятия — не позднее дня занятия. Оплата — наличными в кассу Исполнителя или безналичным "
			+ "переводом по реквизитам Исполнителя.'");

КонецФункции

//Стоимость по абонементу: Структура(Стоимость, ОписаниеСтоимости, ПредметОбучения, ДатаНачала, ДатаОкончания,
//Организация, Обучающийся) — цена абонемента, «за N занятий по абонементу «…»», срок абонемента.
Функция ДанныеАбонемента(Абонемент) Экспорт

	Данные = Новый Структура("Стоимость, ОписаниеСтоимости, ПредметОбучения, ДатаНачала, ДатаОкончания, Организация, "
		+ "Обучающийся");
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Абонементы.ЦенаАбонемента КАК Стоимость,
	|	Абонементы.КоличествоЗанятий КАК КоличествоЗанятий,
	|	Абонементы.КоличествоЧасов КАК КоличествоЧасов,
	|	Абонементы.Наименование КАК Наименование,
	|	Абонементы.ПредметОбучения КАК ПредметОбучения,
	|	Абонементы.ДатаНачала КАК ДатаНачала,
	|	Абонементы.ДатаОкончания КАК ДатаОкончания,
	|	Абонементы.Организация КАК Организация,
	|	Абонементы.ФизЛицо КАК Обучающийся
	|ИЗ
	|	Справочник.УЗ_Абонемент КАК Абонементы
	|ГДЕ
	|	Абонементы.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Абонемент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Данные, Выборка);
	Если Выборка.КоличествоЗанятий > 0 Тогда
		Единицы = СтрШаблон(НСтр("ru = '%1 занятий'"), Формат(Выборка.КоличествоЗанятий, "ЧГ="));
	ИначеЕсли Выборка.КоличествоЧасов > 0 Тогда
		Единицы = СтрШаблон(НСтр("ru = '%1 ч занятий'"), УЗ_ОбщийКлиентСервер.ЧасыМинуты(Выборка.КоличествоЧасов));
	Иначе
		Единицы = НСтр("ru = 'занятия'");
	КонецЕсли;
	Данные.ОписаниеСтоимости = СтрШаблон(НСтр("ru = 'за %1 по абонементу "
		+ "«%2»'"), Единицы, СокрЛП(Выборка.Наименование));
	Возврат Данные;

КонецФункции

//Стоимость по тарифу ученика на дату: Структура(Стоимость, ОписаниеСтоимости) — цена тарифа, «за 1 урок» /
//«за 8 уроков по тарифу «…»»; цены нет — Неопределено.
Функция ДанныеТарифа(Тариф, НаДату) Экспорт

	Если Не ЗначениеЗаполнено(Тариф) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Цена = РегистрыСведений.УЗ_ЦеныТарифов.ПолучитьСуммуТарифаНаДату(Тариф, НаДату);
	Если Цена = Неопределено Или Не РегистрыСведений.УЗ_ЦеныТарифов.ЦенаКарточкиЗаполнена(Цена) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Цена.КоличествоУроков > 0 Тогда
		Единицы = СтрШаблон(НСтр("ru = '%1 занят.'"), Формат(Цена.КоличествоУроков, "ЧГ="));
	Иначе
		Единицы = СтрШаблон(НСтр("ru = '%1 ч занятий'"), УЗ_ОбщийКлиентСервер.ЧасыМинуты(Цена.КоличествоЧасов));
	КонецЕсли;
	Возврат Новый Структура("Стоимость, ОписаниеСтоимости", Цена.Сумма,
		СтрШаблон(НСтр("ru = 'за %1 по тарифу «%2»'"), Единицы, СокрЛП(Тариф)));

КонецФункции

//Договор: заголовок, преамбула, разделы 1–5 абзацами, реквизиты и подписи сторон. Каждый договор — с новой
//страницы. Вид договора — по основанию деятельности исполнителя: с лицензией или у ИП, который учит сам, — «об
//оказании платных образовательных услуг» (Правила № 1441), иначе — «возмездного оказания услуг» (гл. 39 ГК РФ).
Функция ПечатьДоговора(МассивОбъектов, ОбъектыПечати) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УЗ_ДоговорОбучения_Договор";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Макет = Документы.УЗ_ДоговорОбучения.ПолучитьМакет("ПечатьДоговора");

	Для Каждого Ссылка Из МассивОбъектов Цикл

		Договор = Ссылка.ПолучитьОбъект();
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Данные = ДанныеДоговора(Договор);

		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.НомерДоговора = УЗ_ОбщийКлиентСервер.НомерНаПечать(Договор.Номер);
		Область.Параметры.ВидДоговора = ?(Данные.Образовательный,
			НСтр("ru = 'об оказании платных образовательных услуг'"), НСтр("ru = 'возмездного оказания услуг по "
				+ "обучению'"));
		Область.Параметры.ДатаДоговора = Формат(Договор.Дата, "ДЛФ=DD");
		ТабличныйДокумент.Вывести(Область);

		Для Каждого Абзац Из ТекстДоговора(Договор, Данные) Цикл
			Если СтрНачинаетсяС(Абзац, "#") Тогда
				Область = Макет.ПолучитьОбласть("Раздел");
				Область.Параметры.ЗаголовокРаздела = Сред(Абзац, 2);
			Иначе
				Область = Макет.ПолучитьОбласть("Абзац");
				Область.Параметры.ТекстАбзаца = Абзац;
			КонецЕсли;
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;

		Область = Макет.ПолучитьОбласть("Раздел");
		Область.Параметры.ЗаголовокРаздела = НСтр("ru = '6. Адреса, реквизиты и подписи сторон'");
		ТабличныйДокумент.Вывести(Область);
		Область = Макет.ПолучитьОбласть("СтороныШапка");
		Область.Параметры.СторонаСлева = НСтр("ru = 'Исполнитель'");
		Область.Параметры.СторонаСправа = НСтр("ru = 'Заказчик'");
		ТабличныйДокумент.Вывести(Область);
		Область = Макет.ПолучитьОбласть("СтороныРеквизиты");
		Область.Параметры.РеквизитыСлева = РеквизитыИсполнителя(Данные.Исполнитель);
		Область.Параметры.РеквизитыСправа = РеквизитыЛица(Данные.Заказчик);
		ТабличныйДокумент.Вывести(Область);
		Область = Макет.ПолучитьОбласть("СтороныПодписи");
		Область.Параметры.ПодписьСлева = УЗ_ОбщийКлиентСервер.КраткоеФИО(Данные.ПодписантИсполнителя);
		Область.Параметры.ПодписьСправа = УЗ_ОбщийКлиентСервер.КраткоеФИО(Данные.Заказчик.ФИО);
		ТабличныйДокумент.Вывести(Область);

		УЗ_Печать.ЗадатьОбластьДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);

	КонецЦикла;

	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	Возврат ТабличныйДокумент;

КонецФункции

//Стороны договора — Структура: Исполнитель (УЗ_РеквизитыОрганизаций.РеквизитыОрганизации), Заказчик и Обучающийся
//(ФИО, ДатаРождения, Телефон, EMail, документ), ОдноЛицо (заказчик — сам обучающийся), Образовательный (есть
//лицензия или ИП учит сам), ПодписантИсполнителя (ФИО).
Функция ДанныеДоговора(Договор) Экспорт

	Данные = Новый Структура;
	Исполнитель = РегистрыСведений.УЗ_РеквизитыОрганизаций.РеквизитыОрганизации(Договор.Организация);
	Данные.Вставить("Исполнитель", Исполнитель);
	Данные.Вставить("Образовательный", Не ПустаяСтрока(Исполнитель.ОснованиеДеятельности));
	Заказчик = ?(ЗначениеЗаполнено(Договор.Заказчик), Договор.Заказчик, Договор.Обучающийся);
	Данные.Вставить("ОдноЛицо", Заказчик = Договор.Обучающийся);
	Данные.Вставить("Заказчик", ДанныеЛица(Заказчик));
	Данные.Вставить("Обучающийся", ДанныеЛица(Договор.Обучающийся));
	Подписант = СокрЛП(Исполнитель.Подписант);
	Если ПустаяСтрока(Подписант) И Исполнитель.ЭтоИП Тогда
		Подписант = Исполнитель.ФИОПредпринимателя;
	КонецЕсли;
	Данные.Вставить("ПодписантИсполнителя", Подписант);
	Возврат Данные;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Абзацы договора по порядку; строка с «#» — заголовок раздела.
Функция ТекстДоговора(Договор, Данные)

	Абзацы = Новый Массив;
	Абзацы.Добавить(Преамбула(Данные));

	Абзацы.Добавить("#" + НСтр("ru = '1. Предмет договора'"));
	Если ЗначениеЗаполнено(Договор.Программа) Тогда
		Предмет = СокрЛП(Договор.Программа);
	ИначеЕсли ЗначениеЗаполнено(Договор.ПредметОбучения) Тогда
		Предмет = СтрШаблон(НСтр("ru = 'программе занятий по предмету «%1»'"), СокрЛП(Договор.ПредметОбучения));
	Иначе
		Предмет = НСтр("ru = 'программе занятий Исполнителя'");
	КонецЕсли;
	Если Данные.Образовательный Тогда
		Абзацы.Добавить(СтрШаблон(НСтр("ru = '1.1. Исполнитель обязуется предоставить Обучающемуся "
			+ "образовательную услугу — обучение по %1, а Заказчик обязуется оплатить её. Форма обучения — очная.'"),
			Предмет));
	Иначе
		Абзацы.Добавить(СтрШаблон(НСтр("ru = '1.1. Исполнитель обязуется оказать Обучающемуся услуги по обучению "
			+ "(проведение занятий) по %1, а Заказчик обязуется оплатить их.'"),
			Предмет));
	КонецЕсли;
	Если ЗначениеЗаполнено(Договор.ДатаНачала) И ЗначениеЗаполнено(Договор.ДатаОкончания) Тогда
		Абзацы.Добавить(СтрШаблон(НСтр("ru = '1.2. Срок оказания услуг: с %1 по %2.'"),
			Формат(Договор.ДатаНачала, "ДЛФ=D"), Формат(Договор.ДатаОкончания, "ДЛФ=D")));
	Иначе
		Абзацы.Добавить(НСтр("ru = '1.2. Срок оказания услуг определяется расписанием занятий и сроком действия "
			+ "приобретённых абонементов.'"));
	КонецЕсли;
	Абзацы.Добавить(НСтр("ru = '1.3. Занятия проводятся по расписанию, которое устанавливает Исполнитель и "
		+ "доводит до сведения Заказчика.'"));

	Абзацы.Добавить("#" + НСтр("ru = '2. Права и обязанности сторон'"));
	Абзацы.Добавить(НСтр("ru = '2.1. Исполнитель обязуется организовать и провести занятия в соответствии с "
		+ "программой и расписанием, обеспечить Обучающемуся необходимые условия для занятий, сообщать Заказчику "
			+ "об изменении расписания.'"));
	Абзацы.Добавить(НСтр("ru = '2.2. Исполнитель вправе самостоятельно выбирать формы и методы обучения, "
		+ "устанавливать расписание занятий.'"));
	Абзацы.Добавить(НСтр("ru = '2.3. Заказчик обязуется своевременно оплачивать услуги, сообщать Исполнителю о "
		+ "пропуске занятий и обеспечить посещение занятий Обучающимся.'"));
	Абзацы.Добавить(НСтр("ru = '2.4. Заказчик вправе получать от Исполнителя информацию об организации занятий и "
		+ "об успехах Обучающегося.'"));

	Абзацы.Добавить("#" + НСтр("ru = '3. Стоимость услуг и порядок оплаты'"));
	Если Договор.Стоимость > 0 Тогда
		Абзацы.Добавить(СтрШаблон(НСтр("ru = '3.1. Стоимость услуг составляет %1 (%2)%3.'"),
			Формат(Договор.Стоимость, "ЧДЦ=2; ЧРГ=' '"),
			ЧислоПрописью(Договор.Стоимость, , НСтр("ru = 'рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2'")),
			?(ПустаяСтрока(Договор.ОписаниеСтоимости), "", " " + СокрЛП(Договор.ОписаниеСтоимости))));
	Иначе
		Абзацы.Добавить(НСтр("ru = '3.1. Стоимость услуг определяется действующими ценами Исполнителя на дату "
			+ "оплаты.'"));
	КонецЕсли;
	Если Данные.Образовательный Тогда
		Абзацы.Добавить(НСтр("ru = '3.2. Увеличение стоимости услуг после заключения договора не допускается, за "
			+ "исключением увеличения с учётом уровня инфляции (часть 3 статьи 54 Федерального закона «Об "
				+ "образовании в Российской Федерации»).'"));
	Иначе
		Абзацы.Добавить(НСтр("ru = '3.2. Стоимость оплаченных занятий после оплаты не изменяется.'"));
	КонецЕсли;
	ПорядокОплаты = СокрЛП(Договор.ПорядокОплаты);
	Абзацы.Добавить(НСтр("ru = '3.3. Порядок оплаты:'") + " "
		+ ?(ПустаяСтрока(ПорядокОплаты), ПорядокОплатыПоУмолчанию(), ПорядокОплаты));

	Абзацы.Добавить("#" + НСтр("ru = '4. Изменение и расторжение договора, возврат денег'"));
	Абзацы.Добавить(НСтр("ru = '4.1. Договор может быть изменён или расторгнут по соглашению сторон.'"));
	Абзацы.Добавить(НСтр("ru = '4.2. Заказчик вправе в любое время отказаться от исполнения договора при условии "
		+ "оплаты Исполнителю фактически понесённых им расходов (статья 32 Закона Российской Федерации «О защите "
			+ "прав потребителей», статья 782 Гражданского кодекса Российской Федерации).'"));
	Абзацы.Добавить(НСтр("ru = '4.3. Деньги, внесённые за занятия, которые не были проведены, возвращаются "
		+ "Заказчику по его заявлению за вычетом фактически понесённых Исполнителем расходов.'"));

	Абзацы.Добавить("#" + НСтр("ru = '5. Срок действия договора и прочие условия'"));
	Если ЗначениеЗаполнено(Договор.ДатаОкончания) Тогда
		Абзацы.Добавить(СтрШаблон(НСтр("ru = '5.1. Договор вступает в силу со дня подписания и действует по %1, а "
			+ "в части оплаты и возврата денег — до полного исполнения обязательств.'"),
			Формат(Договор.ДатаОкончания, "ДЛФ=D")));
	Иначе
		Абзацы.Добавить(НСтр("ru = '5.1. Договор вступает в силу со дня подписания и действует до полного "
			+ "исполнения сторонами обязательств.'"));
	КонецЕсли;
	Абзацы.Добавить(НСтр("ru = '5.2. Договор составлен в двух экземплярах, по одному для каждой стороны. Споры "
		+ "решаются переговорами, а при недостижении согласия — в порядке, установленном законодательством "
			+ "Российской Федерации.'"));
	Если Не Данные.ОдноЛицо Тогда
		Абзацы.Добавить(СтрШаблон(НСтр("ru = '5.3. Обучающийся: %1'"), ОписаниеЛица(Данные.Обучающийся)));
	КонецЕсли;
	Возврат Абзацы;

КонецФункции

Функция Преамбула(Данные)

	Исполнитель = Данные.Исполнитель;
	Части = Новый Массив;
	Части.Добавить(Исполнитель.НаименованиеПолное);
	Если Не ПустаяСтрока(Исполнитель.ОснованиеДеятельности) Тогда
		Части.Добавить(", " + НСтр("ru = 'осуществляющий(ая) образовательную деятельность на основании'") + " "
			+ Исполнитель.ОснованиеДеятельности);
	КонецЕсли;
	Части.Добавить(" " + НСтр("ru = '(далее — Исполнитель)'"));
	Подписант = СокрЛП(Исполнитель.Подписант);
	Если Не ПустаяСтрока(Подписант) И Не (Исполнитель.ЭтоИП И Подписант = Исполнитель.ФИОПредпринимателя) Тогда
		//падежей программа не склоняет: «от имени которого действует директор Сидорова Анна Петровна на основании
		//Устава» — должность и ФИО в именительном падеже, основание — как после слов «на основании»
		Части.Добавить(", " + НСтр("ru = 'от имени которого действует'") + " "
			+ ?(ПустаяСтрока(Исполнитель.ДолжностьПодписанта), "", СокрЛП(Исполнитель.ДолжностьПодписанта) + " ")
			+ Подписант);
		Если Не ПустаяСтрока(Исполнитель.ОснованиеПолномочий) Тогда
			Части.Добавить(" " + НСтр("ru = 'на основании'") + " " + СокрЛП(Исполнитель.ОснованиеПолномочий));
		КонецЕсли;
	КонецЕсли;
	Если Данные.ОдноЛицо Тогда
		Части.Добавить(СтрШаблон(НСтр("ru = ', и %1 (далее — Заказчик, он же Обучающийся)'"), Данные.Заказчик.ФИО));
	Иначе
		Части.Добавить(СтрШаблон(НСтр("ru = ', и %1 (далее — Заказчик), действующий(ая) в интересах обучающегося "
			+ "%2 (далее — Обучающийся)'"),
			Данные.Заказчик.ФИО, Данные.Обучающийся.ФИО));
	КонецЕсли;
	Части.Добавить(", " + НСтр("ru = 'вместе именуемые «Стороны», заключили настоящий договор о нижеследующем.'"));
	Возврат СтрСоединить(Части, "");

КонецФункции

Функция ДанныеЛица(ФизЛицо)

	Данные = РегистрыСведений.УЗ_ДокументыФизЛиц.ДанныеФизЛица(ФизЛицо);
	Данные.Вставить("ФИО", "");
	Данные.Вставить("ДатаРождения", Дата(1, 1, 1));
	Данные.Вставить("Телефон", "");
	Данные.Вставить("EMail", "");
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат Данные;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ФизЛица.Наименование КАК ФИО,
	|	ФизЛица.ДатаРождения КАК ДатаРождения,
	|	ФизЛица.Телефон КАК Телефон,
	|	ФизЛица.EMail КАК EMail
	|ИЗ
	|	Справочник.УЗ_ФизЛица КАК ФизЛица
	|ГДЕ
	|	ФизЛица.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Данные, Выборка);
		Данные.ФИО = СокрЛП(Данные.ФИО);
	КонецЕсли;
	Возврат Данные;

КонецФункции

//«Иванов Пётр Сергеевич, дата рождения 01.02.2015»
Функция ОписаниеЛица(Лицо)

	Текст = Лицо.ФИО;
	Если ЗначениеЗаполнено(Лицо.ДатаРождения) Тогда
		Текст = Текст + ", " + НСтр("ru = 'дата рождения'") + " " + Формат(Лицо.ДатаРождения, "ДЛФ=D");
	КонецЕсли;
	Возврат Текст;

КонецФункции

Функция РеквизитыИсполнителя(Исполнитель)

	Строки = Новый Массив;
	Строки.Добавить(Исполнитель.НаименованиеПолное);
	ИННКПП = Новый Массив;
	Если Не ПустаяСтрока(Исполнитель.ИНН) Тогда
		ИННКПП.Добавить(НСтр("ru = 'ИНН'") + " " + Исполнитель.ИНН);
	КонецЕсли;
	Если Не ПустаяСтрока(Исполнитель.КПП) И Не Исполнитель.ЭтоИП Тогда
		ИННКПП.Добавить(НСтр("ru = 'КПП'") + " " + Исполнитель.КПП);
	КонецЕсли;
	Если ИННКПП.Количество() > 0 Тогда
		Строки.Добавить(СтрСоединить(ИННКПП, ", "));
	КонецЕсли;
	Если Не ПустаяСтрока(Исполнитель.ОснованиеДеятельности) Тогда
		Строки.Добавить(ВРег(Лев(Исполнитель.ОснованиеДеятельности, 1)) + Сред(Исполнитель.ОснованиеДеятельности, 2));
	КонецЕсли;
	ДобавитьСтроку(Строки, НСтр("ru = 'Адрес'"), Исполнитель.Адрес);
	ДобавитьСтроку(Строки, НСтр("ru = 'Телефон'"), Исполнитель.Телефон);
	Если Не ПустаяСтрока(Исполнитель.ПлатежныеРеквизиты) Тогда
		Строки.Добавить(СокрЛП(Исполнитель.ПлатежныеРеквизиты));
	КонецЕсли;
	Возврат СтрСоединить(Строки, Символы.ПС);

КонецФункции

Функция РеквизитыЛица(Лицо)

	Строки = Новый Массив;
	Строки.Добавить(ОписаниеЛица(Лицо));
	Если Не ПустаяСтрока(Лицо.СерияНомерДокумента) Тогда
		Документ = ?(ПустаяСтрока(Лицо.ВидДокумента), НСтр("ru = 'Документ'"), Лицо.ВидДокумента) + " "
			+ Лицо.СерияНомерДокумента;
		Если ЗначениеЗаполнено(Лицо.ДатаВыдачиДокумента) Тогда
			Документ = Документ + ", " + НСтр("ru = 'выдан'") + " " + Формат(Лицо.ДатаВыдачиДокумента, "ДЛФ=D");
		КонецЕсли;
		Строки.Добавить(Документ);
	КонецЕсли;
	ДобавитьСтроку(Строки, НСтр("ru = 'ИНН'"), Лицо.ИНН);
	Строки.Добавить(НСтр("ru = 'Адрес'") + ": ______________________________");
	ДобавитьСтроку(Строки, НСтр("ru = 'Телефон'"), Лицо.Телефон);
	ДобавитьСтроку(Строки, НСтр("ru = 'Эл. почта'"), Лицо.EMail);
	Возврат СтрСоединить(Строки, Символы.ПС);

КонецФункции

Процедура ДобавитьСтроку(Строки, Подпись, Значение)

	Если Не ПустаяСтрока(Значение) Тогда
		Строки.Добавить(Подпись + ": " + СокрЛП(Значение));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
